rails/lab2/app/views/articles/_article.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = 1
---
    <strong>Categories:</strong>
    <%= article.categories.map(&:name).join(", ") %>