rails/lab2/app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label "Categories", style: "display: block" %>
    <% Category.all.each do |category| %>