rails/lab2/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ('Hello', 'this is first article', '2026-03-16 09:55:54.313074', '2026-03-16 09:55:54.313074') RETURNING "id"
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
---
    def set_article
      @article = Article.find(params.expect(:id))